; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-0 - location
	p1-5 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p2-5 - location
	p2-6 - location
	p3-1 - location
	p4-1 - location
	p4-2 - location
	p5-0 - location
	p5-3 - location
	p6-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s3)
	(at driver3 s1)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s0)
	(at package2 s6)
	(at package3 s1)
	(at package4 s2)
	(at package5 s5)
	(at package6 s3)
	(at package7 s4)
	(at package8 s3)
	(at package9 s5)
	(at package10 s5)
	(at package11 s3)
	(at package12 s1)
	(at package13 s5)
	(at package14 s1)
	(at package15 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 40)
	(= (time-to-drive s1 s0) 40)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 23)
	(= (time-to-drive s2 s0) 23)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 52)
	(= (time-to-drive s4 s0) 52)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 47)
	(= (time-to-drive s5 s0) 47)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 77)
	(= (time-to-drive s6 s0) 77)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 70)
	(= (time-to-drive s2 s1) 70)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 88)
	(= (time-to-drive s5 s1) 88)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 1)
	(= (time-to-drive s6 s4) 1)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 40)
	(= (time-to-drive s2 s5) 40)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 84)
	(= (time-to-drive s3 s5) 84)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 85)
	(= (time-to-drive s1 s6) 85)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 77)
	(= (time-to-drive s2 s6) 77)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 41)
	(= (time-to-drive s5 s6) 41)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s2)
	(at truck1 s3)
	(at truck2 s1)
	(at truck3 s2)
	(at truck4 s0)
	(at package1 s5)
	(at package2 s1)
	(at package3 s2)
	(at package4 s6)
	(at package5 s2)
	(at package6 s3)
	(at package7 s4)
	(at package8 s2)
	(at package9 s3)
	(at package10 s6)
	(at package11 s6)
	(at package12 s6)
	(at package13 s0)
	(at package14 s2)
	(at package15 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver1 s3 p5-3)
   deleted: (at driver1 s3)
   added: (at driver1 p5-3)
   goals met: 2 of 21
2. (load-truck package4 truck4 s2)
   deleted: (at package4 s2)
   added: (in package4 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 21
3. (load-truck package5 truck2 s5)
   deleted: (at package5 s5)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 21
4. (load-truck package9 truck2 s5)
   deleted: (at package9 s5)
   added: (in package9 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 21
5. (load-truck package10 truck2 s5)
   deleted: (at package10 s5)
   added: (in package10 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 21
6. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 2 of 21
7. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 21
8. (load-truck package13 truck2 s5)
   deleted: (at package13 s5)
   added: (in package13 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 2 of 21
9. (walk driver3 s1 p1-0)
   deleted: (at driver3 s1)
   added: (at driver3 p1-0)
   goals met: 2 of 21
10. (walk driver1 p5-3 s5)
   deleted: (at driver1 p5-3)
   added: (at driver1 s5)
   goals met: 2 of 21
11. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 21
12. (walk driver3 p1-0 s0)
   deleted: (at driver3 p1-0)
   added: (at driver3 s0)
   goals met: 2 of 21
13. (unload-truck package4 truck4 s2)
   deleted: (in package4 truck4)
   added: (at package4 s2)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 2 of 21
14. (drive-truck truck2 s5 s1 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 0 to 1760
   goals met: 3 of 21
15. (load-truck package3 truck2 s1)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 3 of 21
16. (load-truck package12 truck2 s1)
   deleted: (at package12 s1)
   added: (in package12 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 3 of 21
17. (load-truck package14 truck2 s1)
   deleted: (at package14 s1)
   added: (in package14 truck2)
   changed: (load truck2) from 6 to 7, (fuel-per-minute truck2) from 31 to 38
   goals met: 3 of 21
18. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 1760 to 3280
   goals met: 2 of 21
19. (unload-truck package13 truck2 s0)
   deleted: (in package13 truck2)
   added: (at package13 s0)
   changed: (load truck2) from 7 to 6, (fuel-per-minute truck2) from 38 to 31
   goals met: 3 of 21
20. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 3280 to 4520
   goals met: 4 of 21
21. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 5 of 21
22. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 4520 to 6690
   goals met: 4 of 21
23. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   changed: (load truck2) from 6 to 7, (fuel-per-minute truck2) from 31 to 38
   goals met: 4 of 21
24. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 7 to 6, (fuel-per-minute truck2) from 38 to 31
   goals met: 5 of 21
25. (unload-truck package5 truck2 s2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 6 of 21
26. (unload-truck package14 truck2 s2)
   deleted: (in package14 truck2)
   added: (at package14 s2)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 7 of 21
27. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 21
28. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 6690 to 7150
   goals met: 7 of 21
29. (load-truck package1 truck2 s0)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 7 of 21
30. (drive-truck truck2 s0 s5 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 7150 to 8325
   goals met: 7 of 21
31. (unload-truck package1 truck2 s5)
   deleted: (in package1 truck2)
   added: (at package1 s5)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 8 of 21
32. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 8325 to 9145
   goals met: 8 of 21
33. (unload-truck package4 truck2 s6)
   deleted: (in package4 truck2)
   added: (at package4 s6)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 9 of 21
34. (unload-truck package10 truck2 s6)
   deleted: (in package10 truck2)
   added: (at package10 s6)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 10 of 21
35. (unload-truck package12 truck2 s6)
   deleted: (in package12 truck2)
   added: (at package12 s6)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 11 of 21
36. (load-truck package2 truck2 s6)
   deleted: (at package2 s6)
   added: (in package2 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 11 of 21
37. (drive-truck truck2 s6 s1 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 9145 to 10250
   goals met: 12 of 21
38. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 13 of 21
39. (drive-truck truck2 s1 s5 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 10250 to 11218
   goals met: 12 of 21
40. (drive-truck truck2 s5 s3 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 11218 to 12142
   goals met: 12 of 21
41. (unload-truck package9 truck2 s3)
   deleted: (in package9 truck2)
   added: (at package9 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 13 of 21
42. (load-truck package8 truck2 s3)
   deleted: (at package8 s3)
   added: (in package8 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 13 of 21
43. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 13 of 21
44. (load-truck package15 truck2 s3)
   deleted: (at package15 s3)
   added: (in package15 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 13 of 21
45. (drive-truck truck2 s3 s5 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 12142 to 13486
   goals met: 13 of 21
46. (drive-truck truck2 s5 s1 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 13486 to 14894
   goals met: 14 of 21
47. (unload-truck package15 truck2 s1)
   deleted: (in package15 truck2)
   added: (at package15 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 15 of 21
48. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 14894 to 15804
   goals met: 14 of 21
49. (unload-truck package8 truck2 s2)
   deleted: (in package8 truck2)
   added: (at package8 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 15 of 21
50. (drive-truck truck2 s2 s6 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (fuel-used) from 15804 to 16651
   goals met: 15 of 21
51. (unload-truck package11 truck2 s6)
   deleted: (in package11 truck2)
   added: (at package11 s6)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 16 of 21
52. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 16651 to 17421
   goals met: 16 of 21
53. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 16 of 21
54. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 17421 to 17651
   goals met: 17 of 21
55. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 18 of 21
56. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 17 of 21
57. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 16 of 21
58. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 17651 to 17881
   goals met: 17 of 21
59. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 17 of 21
60. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   goals met: 17 of 21
61. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   goals met: 18 of 21
62. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 19 of 21
63. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 18 of 21
64. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 17881 to 18281
   goals met: 19 of 21
65. (drive-truck truck3 s2 s0 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 18281 to 18511
   goals met: 18 of 21
66. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 18 of 21
67. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 18511 to 18911
   goals met: 17 of 21
68. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 18 of 21
69. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 17 of 21
70. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 17 of 21
71. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 18911 to 19311
   goals met: 18 of 21
72. (drive-truck truck1 s0 s5 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (fuel-used) from 19311 to 19781
   goals met: 18 of 21
73. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 19781 to 20621
   goals met: 19 of 21
74. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 18 of 21
75. (drive-truck truck1 s3 s5 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 20621 to 21461
   goals met: 17 of 21
76. (drive-truck truck1 s5 s0 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 21461 to 21931
   goals met: 17 of 21
77. (walk driver2 p2-0 s0)
   deleted: (at driver2 p2-0)
   added: (at driver2 s0)
   goals met: 17 of 21
78. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 18 of 21
79. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 18 of 21
80. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 21931 to 22161
   goals met: 18 of 21
81. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 19 of 21
82. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 18 of 21
83. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 22161 to 22391
   goals met: 19 of 21
84. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 19 of 21
85. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 18 of 21
86. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 18 of 21
87. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   goals met: 19 of 21
88. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 22391 to 22791
   goals met: 19 of 21
89. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 22791 to 23631
   goals met: 20 of 21
90. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 20 of 21
91. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 20 of 21
92. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 21 of 21
